trade_exp/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8c63e70a-01c7-47a3-a926-3460a02e9ce1">
  <name>ПутевойЛист</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e61f4fee-8525-41a9-ad21-be5907fea38b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af4bbbdf-bdd0-4a2b-92f0-69dfe7f6ad3e">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="534f0f68-ab73-4b73-b4aa-76c411d4db64">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e280b4b8-12da-43b1-9c21-e2885a49f131">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="469b028e-bc82-483a-80b7-b022c3e41a51">
    <name>Топливо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba54b8a0-0ed3-49e6-83ee-c66e6d0ac540">
    <name>СпидометрВозвращение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d758c7d1-0de0-4e12-b6cc-a671edd235ee">
    <name>РасходПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="145d6da9-b26d-4e2c-987d-05777d491692">
    <name>РасходФактический</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e8810ab8-d445-4a82-ba44-3f386eefbf93">
    <name>ИзменитьПоказания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2300f4d4-aa5d-43dc-ae90-c4147d7f8ab1">
    <name>СпидометрНачало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fbaa6f1-d561-4ea9-b6e0-ef526257b5bb">
    <name>НормаРасхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea7c213a-f9d3-4a24-9790-2d7b86c61133">
    <name>Механик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1efb3216-0528-4a44-a248-8f25eebff858">
    <name>АдресПодачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="071f68be-a1cf-4538-a6ef-544948485ede">
    <name>ОстатокПриВыезде</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="789aac2b-5008-4c5d-ab96-5bf9fed580fb">
    <name>ОстатокПриВозвращении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="181e9c13-926d-4768-b010-98a1a9e4f3d8">
    <name>Маршруты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b599da77-70b0-488a-b526-9366a08b2bc9">
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2c1473bf-f604-40b5-bbef-89fd2debcfdf">
      <name>МестоОтправления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7965af58-cbdc-4643-a593-4ef31e9c9b97">
      <name>МестоНазначения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c0e3b695-1aed-4e99-9fde-1c366a175a6d">
      <name>Обратно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="982b0fa0-6a0c-4a13-96c0-a35920f238e3">
      <name>Пройдено</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>7</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d706ee5a-4249-475e-9efd-2fc655f52d0d">
      <name>ВремяВыезда</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3ece1aac-c39f-4cab-9539-f0a58be2b0a3">
      <name>ВремяВозвращения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ПоказанияСпидометра/ПоказанияСпидометра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6bbdd45e-3108-4388-a936-aab9f86c3aa5">
  <name>ПоказанияСпидометра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="e57eca78-f907-4707-90a0-bc2056a62ff5">
    <name>Показания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="57f5b428-3f79-4fe3-8b5a-b9eae9ad500b">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПутевойЛист/ManagerModule.bsl
#Область ОбработчикиСобытий

Функция ПоказаниеСпидометра(ДокументСсылка,ТС)экспорт
   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияСпидометраСрезПоследних.Показания
		|ИЗ
		|	РегистрСведений.ПоказанияСпидометра.СрезПоследних(&период, ТранспортноеСредство = &ТранспортноеСредство) КАК ПоказанияСпидометраСрезПоследних";

	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата-1);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТС);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		Показание = Выборка.Показания;
	иначе
		Показание=ТС.НачальноеПоказание;
	конецесли;
	Возврат Показание;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции // ПоказаниеСпидометра()

Функция ОстатокГСМ(ДокументСсылка,Склад,Топливо)экспорт
   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Топливо,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) + ЕСТЬNULL(ДвижениеТопливаОстатки.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&период,
		|			Склад = &Склад
		|				И Номенклатура = &Топливо) КАК ТоварыНаСкладахОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоплива.Остатки(
		|				&период,
		|				Склад = &Склад
		|					И Топливо = &топливо) КАК ДвижениеТопливаОстатки
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ДвижениеТопливаОстатки.Топливо
		|			И ТоварыНаСкладахОстатки.Склад = ДвижениеТопливаОстатки.Склад
		|{ИТОГИ ПО
		|	Количество}";

	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата-1);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("топливо", Топливо);


	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		Показание = Выборка.Количество;
	иначе
		Показание=0;
	конецесли;
	Возврат Показание;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции // ПоказаниеСпидометра()

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
                                  
#Область Печать 
	                      
Процедура ДобавитьКомандыПечати(КомандыПечати)Экспорт   
	   // Печать Путевого Листа
		КомандаПечати = КомандыПечати.Добавить();
	    КомандаПечати.МенеджерПечати =  "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛист";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (лицевая)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.СразуНаПринтер = Ложь;
        КомандаПечати.Порядок = 1;
		
		// Печать Путевого Листа Б
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛистБ";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (оборотная)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.СразуНаПринтер = Ложь;
		КомандаПечати.Порядок = 2;
	
		// Печать Путевого Листа   новый
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати =  "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛистНовый";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (лицевая) от 01.03.2023'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.СразуНаПринтер = Ложь;
		КомандаПечати.Порядок = 3;
		
		// Печать Путевого Листа Б  новый
		КомандаПечати = КомандыПечати.Добавить();  
		КомандаПечати.МенеджерПечати =  "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛистБНовый";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (оборотная) от 01.03.2023'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.СразуНаПринтер = Ложь;
		КомандаПечати.Порядок = 4;     
	
		// Печать Путевого Листа от 01.09.2023
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати =  "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛистОт01092023";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (лицевая) от 01.09.2023'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.СразуНаПринтер = Ложь;
		КомандаПечати.Порядок = 5;
		
		// Печать Путевого Листа Б от 01.09.2023
		КомандаПечати = КомандыПечати.Добавить();  
		КомандаПечати.МенеджерПечати =  "Документ.ПутевойЛист";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПутевойЛистБОт01092023";
		КомандаПечати.Представление = НСтр("ru = 'Печать путевого листа (оборотная) от 01.09.2023'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.СразуНаПринтер = Ложь;
		КомандаПечати.Порядок = 6;

		
	 
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛист") Тогда
		ТабДок= СформироватьПутевойЛист(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛист", НСтр("ru = 'Печать путевого листа (лицевая)'"), ТабДок); 
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛистБ") Тогда
		ТабДок= СформироватьПутевойЛистБ(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛистБ", НСтр("ru = 'Печать путевого листа (оборотная)'"), ТабДок); 
		
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛистНовый") Тогда
		ТабДок= СформироватьПутевойЛистНовый(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛистНовый", НСтр("ru = 'Печать путевого листа (лицевая) от 01.03.2023'"), ТабДок); 
		
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛистБНовый") Тогда
		ТабДок= СформироватьПутевойЛистБНовый(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛистБНовый", НСтр("ru = 'Печать путевого листа (оборотная) от 01.03.2023'"), ТабДок);
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛистОт01092023") Тогда
		ТабДок= СформироватьПутевойЛистОт01092023(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛистОт01092023", НСтр("ru = 'Печать путевого листа (лицевая) от 01.09.2023'"), ТабДок); 
		
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПутевойЛистБОт01092023") Тогда
		ТабДок= СформироватьПутевойЛистБОт01092023(МассивОбъектов,ОбъектыПечати,ПараметрыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПутевойЛистБОт01092023", НСтр("ru = 'Печать путевого листа (оборотная) от 01.09.2023'"), ТабДок);
    КонецЕсли;

		
КонецПроцедуры

Функция СформироватьПутевойЛист(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.НаименованиеСокращенное) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.КодПоОКПО) КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.Префикс) КАК Префикс,
	|	ПутевойЛист.Ссылка КАК Ссылка,
	|	ПутевойЛист.Номер КАК Номер,
	|	ПутевойЛист.Дата КАК ДатаДокумента,
	|	ПутевойЛист.Организация КАК Организация,
	|	ПутевойЛист.Водитель.ФизическоеЛицо КАК Водитель,
	|	ПутевойЛист.Механик,
	|	ПутевойЛист.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	|	ПутевойЛист.ТранспортноеСредство.Модель КАК МаркаАвтомобиля,
	|	ПутевойЛист.Водитель.НомерВодительскогоУдостоверения КАК НомерУдостоверения,
	|	ПутевойЛист.РасходПоНорме,
	|	ПутевойЛист.РасходФактический,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрНачало
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрНачало,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрВозвращение
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрВозвращение,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВыезде
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВыезде,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВозвращении
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВозвращении,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме > ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходПоНорме - ПутевойЛист.РасходФактический
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Экономия,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме < ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходФактический - ПутевойЛист.РасходПоНорме
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Перерасход
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка в (&МассивОбъектов)";
	 	
	ВыборкаПоДокументам		= ЗапросПоДокументам.Выполнить().Выбрать();
	
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛист");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист";
	ОбластьШапки 						= Макет.ПолучитьОбласть("Шапка");
	
	ВыборкаПоДокументам.Следующий();
		
	ОбластьШапки.Параметры.Заполнить(ВыборкаПоДокументам);
	ОбластьШапки.Параметры.Водитель=ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Водитель);
	ОбластьШапки.Параметры.Механик=ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Механик);
	ОбластьШапки.Параметры.НомерДокумента=ВыборкаПоДокументам.Номер;
	ОбластьШапки.Параметры.ДатаДокумента=ВыборкаПоДокументам.ДатаДокумента;
	ТабДокумент.Вывести(ОбластьШапки);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент; 
	
КонецФункции

Функция СформироватьПутевойЛистБ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПутевойЛистМаршруты.Дата КАК Дата,
	|	ПутевойЛистМаршруты.МестоОтправления,
	|	ПутевойЛистМаршруты.МестоНазначения,
	|	ПутевойЛистМаршруты.Обратно,
	|	ПутевойЛистМаршруты.Пройдено КАК Пройдено,
	|	ПутевойЛистМаршруты.ВремяВыезда,
	|	ПутевойЛистМаршруты.ВремяВозвращения
	|ИЗ
	|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
	|ГДЕ
	|	ПутевойЛистМаршруты.Ссылка в (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Пройдено)
	|ПО
	|	ОБЩИЕ";
	 	
	ВыборкаПоИтогам		= ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоИтогам.Следующий();
	ВыборкаПоСтрокам = ВыборкаПоИтогам.Выбрать();
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛистБ");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛистНовый";
	ОбластьШапки 						= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтроки 						= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьСтрокиПустая					= Макет.ПолучитьОбласть("СтрокаТаблицыПустая");
	ОбластьПодвала 						= Макет.ПолучитьОбласть("ПодвалТаблицы");

	ТабДокумент.Вывести(ОбластьШапки);
    к=0;
	пока ВыборкаПоСтрокам.Следующий() цикл
	к=к+1;	
	ОбластьСтроки.Параметры.Заполнить(ВыборкаПоСтрокам);
	ОбластьСтроки.Параметры.Маршрут=СОКРЛП(ВыборкаПоСтрокам.МестоОтправления)+" - "+СОКРЛП(ВыборкаПоСтрокам.МестоНазначения)+?(ВыборкаПоСтрокам.Обратно," - "+СОКРЛП(ВыборкаПоСтрокам.МестоОтправления),"");
	ТабДокумент.Вывести(ОбластьСтроки);
	конеццикла;

	для н=к по 25 цикл
		ТабДокумент.Вывести(ОбластьСтрокиПустая);
	конеццикла;	
	ОбластьПодвала.Параметры.ИтогоКМ=ВыборкаПоИтогам.Пройдено;
	ТабДокумент.Вывести(ОбластьПодвала);
	ТабДокумент.АвтоМасштаб = Истина;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПутевойЛистНовый(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.НаименованиеПолное) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.КодПоОКПО) КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.Префикс) КАК Префикс,
	|	ПутевойЛист.Ссылка КАК Ссылка,
	|	ПутевойЛист.Номер КАК Номер,
	|	ПутевойЛист.Дата КАК ДатаДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.НаименованиеСокращенное) КАК Организация,
	|	ПутевойЛист.Водитель.ФизическоеЛицо КАК Водитель,
	|	ПутевойЛист.Механик КАК Механик,
	|	ПутевойЛист.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	|	ПутевойЛист.ТранспортноеСредство.Модель КАК МаркаАвтомобиля,
	|	ПутевойЛист.Водитель.НомерВодительскогоУдостоверения КАК НомерУдостоверения,
	|	ПутевойЛист.РасходПоНорме КАК РасходПоНорме,
	|	ПутевойЛист.РасходФактический КАК РасходФактический,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрНачало
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрНачало,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрВозвращение
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрВозвращение,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВыезде
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВыезде,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВозвращении
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВозвращении,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме > ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходПоНорме - ПутевойЛист.РасходФактический
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Экономия,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме < ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходФактический - ПутевойЛист.РасходПоНорме
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Перерасход,
	|	ПутевойЛист.АдресПодачи КАК АдресПодачи,
	|	ПутевойЛист.Организация.ОГРН КАК ОГРН,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Топливо.Марка = ЗНАЧЕНИЕ(Справочник.Марки.пустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-92%""
	|						ТОГДА ""АИ-92""
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-95%""
	|						ТОГДА ""АИ-95""
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-98%""
	|						ТОГДА ""АИ-98""
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ПутевойЛист.Топливо.Марка.Наименование
	|	КОНЕЦ КАК Марка,
	|	ПутевойЛист.Водитель.Класс КАК Класс,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Топливо.КодОКПД2 = ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.пустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-92%""
	|						ТОГДА ""19.20.21.110""
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-95%""
	|						ТОГДА ""19.20.21.120""
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ПутевойЛист.Топливо.КодОКПД2.Наименование
	|	КОНЕЦ КАК Код
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка В(&МассивОбъектов)";
	 	
	ВыборкаПоДокументам		= ЗапросПоДокументам.Выполнить().Выбрать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
		|	ОрганизацииКонтактнаяИнформация.Вид.Наименование КАК Вид
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПутевойЛист КАК ПутевойЛист
		|		ПО ОрганизацииКонтактнаяИнформация.Ссылка = ПутевойЛист.Организация
		|ГДЕ
		|	ПутевойЛист.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтакты= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКонтакты.Следующий() Цикл
		Если ВыборкаКонтакты.Вид = "Телефон" Тогда  
			Телефон = ВыборкаКонтакты.Представление;
		КонецЕсли;
		
		Если ВыборкаКонтакты.Вид = "Юридический адрес" Тогда  
			Адрес = ВыборкаКонтакты.Представление;
		КонецЕсли;
	КонецЦикла;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПутевойЛистМаршруты.Дата КАК Дата
	|ИЗ
	|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
	|ГДЕ
	|	ПутевойЛистМаршруты.Ссылка В(&МассивОбъектов)"; 
	
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапросаДата = Запрос.Выполнить();
    ВыборкаДата = РезультатЗапросаДата.Выбрать();
	ВыборкаДата.Следующий();
	Дата =КонецМесяца(ВыборкаДата.Дата);
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛистНовый");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛистНовый";
	ОбластьШапки 						= Макет.ПолучитьОбласть("Шапка");
	
	ВыборкаПоДокументам.Следующий(); 
	
	ОбластьШапки.Параметры.Адрес= Адрес;
	ОбластьШапки.Параметры.Телефон= Телефон; 
	ОбластьШапки.Параметры.Заполнить(ВыборкаПоДокументам); 
	//ОбластьШапки.Параметры.ДатаДокумента = формат(ВыборкаПоДокументам.ДатаДокумента,"ДФ='dd MMMM yyyy'");
	ОбластьШапки.Параметры.Водитель = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Водитель);
	ОбластьШапки.Параметры.ВодительФИО = ВыборкаПоДокументам.Водитель;
	
	
	ОбластьШапки.Параметры.Число = формат(Дата,"ДФ='dd'");  
	ОбластьШапки.Параметры.Месяц = (формат(Дата,"ДФ=MM")); 
	ОбластьШапки.Параметры.Год = формат(Дата,"ДФ='yy'");

	
	Марка = ВыборкаПоДокументам.Марка;
		
	ТабДокумент.Вывести(ОбластьШапки);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПутевойЛистБНовый(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПутевойЛистМаршруты.Дата КАК Дата,
	|	ПутевойЛистМаршруты.МестоОтправления КАК МестоОтправления,
	|	ПутевойЛистМаршруты.МестоНазначения КАК МестоНазначения,
	|	ПутевойЛистМаршруты.Обратно КАК Обратно,
	|	ПутевойЛистМаршруты.Пройдено КАК Пройдено,
	|	ПутевойЛистМаршруты.ВремяВыезда КАК ВремяВыезда,
	|	ПутевойЛистМаршруты.ВремяВозвращения КАК ВремяВозвращения,
	|	ПутевойЛистМаршруты.Ссылка.Водитель.ФизическоеЛицо КАК Водитель
	|ИЗ
	|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
	|ГДЕ
	|	ПутевойЛистМаршруты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Пройдено)
	|ПО
	|	ОБЩИЕ";
	 	
	ВыборкаПоИтогам		= ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоИтогам.Следующий();
	ВыборкаПоСтрокам = ВыборкаПоИтогам.Выбрать();
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛистБНОвый");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛистБНовый";
	ОбластьШапки 						= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтроки 						= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьСтрокиПустая					= Макет.ПолучитьОбласть("СтрокаТаблицыПустая");
	ОбластьПодвала 						= Макет.ПолучитьОбласть("ПодвалТаблицы");

	ТабДокумент.Вывести(ОбластьШапки);
	к=0;     
	пока ВыборкаПоСтрокам.Следующий() цикл
		к=к+1; 
		Если к = 1 тогда
			ОбластьПодвала.Параметры.Водитель = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоСтрокам.Водитель);
		КонецЕсли;
		ОбластьСтроки.Параметры.Номер = к;
		ОбластьСтроки.Параметры.Заполнить(ВыборкаПоСтрокам);
		ОбластьСтроки.Параметры.Маршрут=СОКРЛП(ВыборкаПоСтрокам.МестоОтправления)+" - "+СОКРЛП(ВыборкаПоСтрокам.МестоНазначения)+?(ВыборкаПоСтрокам.Обратно," - "+СОКРЛП(ВыборкаПоСтрокам.МестоОтправления),"");
		ТабДокумент.Вывести(ОбластьСтроки); 
	конеццикла;
	
	для н=к по 25 цикл
		ТабДокумент.Вывести(ОбластьСтрокиПустая);
	конеццикла;	
	ОбластьПодвала.Параметры.ИтогоКМ=ВыборкаПоИтогам.Пройдено; 
	ТабДокумент.Вывести(ОбластьПодвала);
	ТабДокумент.АвтоМасштаб = Истина;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПутевойЛистОт01092023(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.НаименованиеПолное) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.КодПоОКПО) КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.Префикс) КАК Префикс,
	|	ПутевойЛист.Ссылка КАК Ссылка,
	|	ПутевойЛист.Номер КАК Номер,
	|	ПутевойЛист.Дата КАК ДатаДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ПутевойЛист.Организация.НаименованиеСокращенное) КАК Организация,
	|	ПутевойЛист.Водитель.ФизическоеЛицо КАК Водитель,
	|	ПутевойЛист.Механик КАК Механик,
	|	ПутевойЛист.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	|	ПутевойЛист.ТранспортноеСредство.Модель КАК МаркаАвтомобиля,
	|	ПутевойЛист.Водитель.НомерВодительскогоУдостоверения КАК НомерУдостоверения,
	|	ПутевойЛист.РасходПоНорме КАК РасходПоНорме,
	|	ПутевойЛист.РасходФактический КАК РасходФактический,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрНачало
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрНачало,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.ТранспортноеСредство.УчитыватьПоказанияСпидометра
	|			ТОГДА ПутевойЛист.СпидометрВозвращение
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СпидометрВозвращение,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВыезде
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВыезде,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Водитель.УчитыватьОстатокТоплива
	|			ТОГДА ПутевойЛист.ОстатокПриВозвращении
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОстатокПриВозвращении,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме > ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходПоНорме - ПутевойЛист.РасходФактический
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Экономия,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.РасходПоНорме < ПутевойЛист.РасходФактический
	|			ТОГДА ПутевойЛист.РасходФактический - ПутевойЛист.РасходПоНорме
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Перерасход,
	|	ПутевойЛист.АдресПодачи КАК АдресПодачи,
	|	ПутевойЛист.Организация.ОГРН КАК ОГРН,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Топливо.Марка = ЗНАЧЕНИЕ(Справочник.Марки.пустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-92%""
	|						ТОГДА ""АИ-92""
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-95%""
	|						ТОГДА ""АИ-95""
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ПутевойЛист.Топливо.Марка.Наименование
	|	КОНЕЦ КАК Марка,
	|	ПутевойЛист.Водитель.Класс КАК Класс,
	|	ВЫБОР
	|		КОГДА ПутевойЛист.Топливо.КодОКПД2 = ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.пустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-92%""
	|						ТОГДА ""19.20.21.110""
	|					КОГДА ПутевойЛист.Топливо.Наименование ПОДОБНО ""%АИ-95%""
	|						ТОГДА ""19.20.21.120""
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ПутевойЛист.Топливо.КодОКПД2.Наименование
	|	КОНЕЦ КАК Код
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка В(&МассивОбъектов)";
	 	
	ВыборкаПоДокументам		= ЗапросПоДокументам.Выполнить().Выбрать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
		|	ОрганизацииКонтактнаяИнформация.Вид.Наименование КАК Вид
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПутевойЛист КАК ПутевойЛист
		|		ПО ОрганизацииКонтактнаяИнформация.Ссылка = ПутевойЛист.Организация
		|ГДЕ
		|	ПутевойЛист.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтакты= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКонтакты.Следующий() Цикл
		Если ВыборкаКонтакты.Вид = "Телефон" Тогда  
			Телефон = ВыборкаКонтакты.Представление;
		КонецЕсли;
		
		Если ВыборкаКонтакты.Вид = "Юридический адрес" Тогда  
			Адрес = ВыборкаКонтакты.Представление;
		КонецЕсли;
	КонецЦикла;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПутевойЛистМаршруты.Дата КАК Дата
	|ИЗ
	|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
	|ГДЕ
	|	ПутевойЛистМаршруты.Ссылка В(&МассивОбъектов)"; 
	
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапросаДата = Запрос.Выполнить();
    ВыборкаДата = РезультатЗапросаДата.Выбрать();
	ВыборкаДата.Следующий();
	Дата =КонецМесяца(ВыборкаДата.Дата);
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛистОт01092023");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛистОт01092023";
	ОбластьШапки 						= Макет.ПолучитьОбласть("Шапка");
	
	ВыборкаПоДокументам.Следующий(); 
	
	ОбластьШапки.Параметры.Адрес= Адрес;
	ОбластьШапки.Параметры.Телефон= Телефон; 
	ОбластьШапки.Параметры.Заполнить(ВыборкаПоДокументам); 
	//ОбластьШапки.Параметры.ДатаДокумента = формат(ВыборкаПоДокументам.ДатаДокумента,"ДФ='dd MMMM yyyy'");
	ОбластьШапки.Параметры.Водитель = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Водитель);
	ОбластьШапки.Параметры.ВодительФИО = ВыборкаПоДокументам.Водитель;
	
	
	ОбластьШапки.Параметры.Число = формат(Дата,"ДФ='dd'");  
	ОбластьШапки.Параметры.Месяц = формат(Дата,"ДФ=MM"); 
	ОбластьШапки.Параметры.Год = формат(Дата,"ДФ='yy'");

	
	Марка = ВыборкаПоДокументам.Марка;   
		
	ТабДокумент.Вывести(ОбластьШапки);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПутевойЛистБОт01092023(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	ПутевойЛистМаршруты.Дата КАК Дата,
	|	ПутевойЛистМаршруты.МестоОтправления КАК МестоОтправления,
	|	ПутевойЛистМаршруты.МестоНазначения КАК МестоНазначения,
	|	ПутевойЛистМаршруты.Обратно КАК Обратно,
	|	ПутевойЛистМаршруты.Пройдено КАК Пройдено,
	|	ПутевойЛистМаршруты.ВремяВыезда КАК ВремяВыезда,
	|	ПутевойЛистМаршруты.ВремяВозвращения КАК ВремяВозвращения,
	|	ПутевойЛистМаршруты.Ссылка.Водитель.ФизическоеЛицо КАК Водитель
	|ИЗ
	|	Документ.ПутевойЛист.Маршруты КАК ПутевойЛистМаршруты
	|ГДЕ
	|	ПутевойЛистМаршруты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Пройдено)
	|ПО
	|	ОБЩИЕ";
	 	
	ВыборкаПоИтогам		= ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоИтогам.Следующий();
	ВыборкаПоСтрокам = ВыборкаПоИтогам.Выбрать();
	
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист.ПФ_MXL_ПутевойЛистБОт01092023");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛистБОт01092023";
	ОбластьШапки 						= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтроки 						= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьСтрокиПустая					= Макет.ПолучитьОбласть("СтрокаТаблицыПустая");
	ОбластьПодвала 						= Макет.ПолучитьОбласть("ПодвалТаблицы");

	ТабДокумент.Вывести(ОбластьШапки);
	к=0;     
	пока ВыборкаПоСтрокам.Следующий() цикл
		к=к+1; 
		Если к = 1 тогда
			ОбластьПодвала.Параметры.Водитель = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоСтрокам.Водитель);
		КонецЕсли;
		ОбластьСтроки.Параметры.Номер = к;
		ОбластьСтроки.Параметры.Заполнить(ВыборкаПоСтрокам);
		ОбластьСтроки.Параметры.Маршрут=СОКРЛП(ВыборкаПоСтрокам.МестоОтправления)+" - "+СОКРЛП(ВыборкаПоСтрокам.МестоНазначения)+?(ВыборкаПоСтрокам.Обратно," - "+СОКРЛП(ВыборкаПоСтрокам.МестоОтправления),"");
		
		ВремяВыезда = ВыборкаПоСтрокам.ВремяВыезда;
		ВремяВозвращения = ВыборкаПоСтрокам.ВремяВозвращения;
		Позиция=Найти(ВремяВыезда,":");
		
		ВремяВыездаЧас=Лев(ВремяВыезда,Позиция-1); 
		ВремяВыездаМинуты=Прав(ВремяВыезда,Позиция-1); 
		ВремяВозвратаЧас=Лев(ВремяВозвращения,Позиция-1); 
		ВремяВозвратаМинуты=Прав(ВремяВозвращения,Позиция-1);
		
		ОбластьСтроки.Параметры.ВремяВыездаЧасы = ВремяВыездаЧас; 
		ОбластьСтроки.Параметры.ВремяВыездаМинуты = ВремяВыездаМинуты; 
		ОбластьСтроки.Параметры.ВремяВозвратаЧасы = ВремяВозвратаЧас; 
		ОбластьСтроки.Параметры.ВремяВозвратаМинуты = ВремяВозвратаМинуты;
		
		ТабДокумент.Вывести(ОбластьСтроки); 
	конеццикла;
	
	для н=к по 25 цикл
		ТабДокумент.Вывести(ОбластьСтрокиПустая);
	конеццикла;	
	ОбластьПодвала.Параметры.ИтогоКМ=ВыборкаПоИтогам.Пройдено; 
	ТабДокумент.Вывести(ОбластьПодвала);
	ТабДокумент.АвтоМасштаб = Истина;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции
           

#КонецОбласти

#КонецОбласти

#КонецЕсли
